Repository: pukerwho/web-g
Catalog: languages/*.po
Languages: uk

source: Данный сайт является информационной площадкой - мы не бронируем номера и не сдаем жилье. Мы следим, чтобы на сайте была только актуальная и правдивая информация, но иногда мы можем что-то упустить. Поэтому будем рады помощи с вашей стороны.
uk: Даний сайт є інформаційним майданчиком – ми не бронюємо номери та не здаємо житло. Ми стежимо, щоб на сайті була лише актуальна та правдива інформація, але іноді ми можемо щось упустити. Тож будемо раді допомоги з вашого боку.

source: Информация
uk: Інформація

source: Мы в соцсетях
uk: Ми у соцмережах

source: Вы можете самостоятельно добавить объявление на наш сайт
uk: Ви можете самостійно додати оголошення на наш сайт

source: Каталог лучших отелей Украины
uk: Каталог найкращих готелів України

source: Отель дня
uk: Готель дня

source: Добавлено
uk: Додано

source: Просмотров
uk: Переглядів

source: Недавно добавленные
uk: Нещодавно додані

source: Добавьте свой отель прямо сейчас!
uk: Додайте свій готель зараз!

source: Это абсолютно бесплатно
uk: Це повністю безкоштовно

source: Добавить отель за 5 минут
uk: Додати готель за 5 хвилин

source: Карпаты
uk: Карпати

source: Отелей
uk: Готелів

source: Посмотреть все
uk: Подивитись все

source: Черное море
uk: Чорне море

source: Азовское море
uk: Азовське море

source: Комментарии
uk: Коментарі

source: Главная
uk: Головна

source: Отели
uk: Готелі

source: Рейтинг отеля
uk: Рейтинг готелю

source: Дата добавления
uk: Дата додавання

source: Описание
uk: Опис

source: Контакты
uk: Контакти

source: Адрес
uk: Адреса

source: Телефоны
uk: Телефони

source: Удобства
uk: Зручності

source: Горячая вода
uk: Гаряча вода

source: Стиральная машина
uk: Пральна машина

source: Полотенца, мыло, бумага
uk: Рушники, мило, папір

source: Плечики
uk: Плічка

source: Постельное белье
uk: Постільна білизна

source: Жалюзи
uk: Жалюзі

source: Утюг
uk: Праска

source: Телевизор
uk: Телевізор

source: Кондиционер
uk: Кондиціонер

source: Отопление
uk: Опалення

source: Микроволновая печь
uk: Мікрохвильова піч

source: Мини-холодильник
uk: Міні холодильник

source: Электроплита
uk: Електроплита

source: Мини-сейф
uk: Міні-сейф

source: Кроватка
uk: Ліжечко

source: Огнетушитель
uk: Вогнегасник

source: Бесплатная парковка
uk: Безкоштовне паркування

source: Обязательно сообщите, что нашли номер телефона на сайте
uk: Обов'язково повідомте, що знайшли номер телефону на сайті

source: Все отели в этом городе
uk: Всі готелі у цьому місті

source: Cамые лучшие
uk: Найкращі

source: Лучшие отели в Киеве
uk: Найкращі готелі у Києві

source: Лучшие отели в Одессе
uk: Найкращі готелі в Одесі

source: Лучшие отели в Харькове
uk: Найкращі готелі у Харкові

source: Добавить отель
uk: Додати готель

source: Вы можете самостоятельно добавить отель на наш сайт
uk: Ви можете самостійно додати готель на наш сайт

source: Добавить
uk: Додати

source: Отелей в каталоге
uk: Готелів у каталозі

source: Последнее объявление
uk: Останнє оголошення

source: Сейчас смотрят эти города
uk: Зараз дивляться ці міста

source: Самые популярные отели
uk: Найпопулярніші готелі

source: Все курорты
uk: Усі курорти

source: Лучшие отели в Карпатах
uk: Найкращі готелі в Карпатах

source: Лучшие отели на Черном море
uk: Найкращі готелі на Чорному морі

source: Лучшие отели на Азовском море
uk: Найкращі готелі на Азовському морі

source: Все отели в нашем каталоге
uk: Всі готелі у нашому каталозі
